<template>
  <div>
    <hr>
    <img src="../assets/interface.jpg"/>
    <h5>接口测试</h5>
    　　什么是接口（API）<br/>
    <p>
    　　API全称Application Programming Interface，这里面我们其实不用去关注AP，只需要I上就可以。一个API就是一个Interface。我们无时不刻不在使用interfaces。我们乘坐电梯里面的按钮是一个interface。我们开车一个踩油门它也是一个interface。我们计算机操作系统也是有很多的接口。(这是目前个人找到比较好理解的一段解释)
    　　接口就是一个位于复杂系统之上并且能简化你的任务，它就像一个中间人让你不需要了解详细的所有细节。那我们今天要讲的Web API就是这么一类东西。像谷歌搜索系统，它提供了搜索接口，简化了你的搜索任务。再像用户登录页面，我们只需要调用我们的登录接口，我们就可以达到登录系统的目的。
    　　现在市面上有非常多种风格的Web API，目前最流行的是也容易访问的一种风格是REST或者叫RESTful 风格的API。从现在开始，以下我提到的所有API都是指RESTful风格的API。
    </p>
    <div id = "content-list" v-for = "item in data">
      <div>{{item.title}}</div>
      <div>{{item.content}}</div>
    </div>
  </div>
</template>

<script>
    export default {
        name: "interface",
        data(){
          return{
            data:[
              {"title":"什么是接口测试和为什么要做接口测试","content":"接口测试是测试系统组件间接口的一种测试。接口测试主要用于检测外部系统与系统之间以及内部各个子系统之间的交互点。测试的重点是要检查数据的交换，传递和控制管理过程，以及系统间的相互逻辑依赖关系等。\n" +
                "　　现在很多系统前后端架构是分离的，从安全层面来说，只依赖前端进行限制已经完全不能满足系统的安全要求（绕过前端太容易了）， 需要后端同样进行控制，在这种情况下就需要从接口层面进行验证。\n" +
                "　　如今系统越来越复杂，传统的靠前端测试已经大大降低了效率，而且现在我们都推崇测试前移，希望测试能更早的介入测试，那接口测试就是一种及早介入的方式。例如传统测试，你是不是得等前后端都完成你才能进行测试，才能进行自动化代码编写。 而如果是接口测试，只需要前后端定义好接口，那这时自动化就可以介入编写接口自动化测试代码，手工测试只需要后端代码完成就可以介入测试后端逻辑而不用等待前端工作完成。"},
              {"title":"接口测试的策略","content":"接口测试也是属于功能测试，所以跟我们以往的功能测试流程并没有太大区别，测试流程依旧是：1.测试接口文档（需求文档） 2.根据接口文档编写测试用例（用例编写完全可以按照以往规则来编写，例如等价类划分，边界值等设计方法） 3. 执行测试，查看不同的参数请求，接口的返回的数据是否达到预期。"},
              {"JSONView 引入":"我们发现直接从Chrome打开我们的查询图书的接口请求，返回的 数据为JSON格式，但是浏览器显示排版难以阅读，这时我们可以考虑安装一些插件来便于我们阅读，例如JSONView插件："},
              {"Postman 引入":"我们刚刚通过浏览器来测试我们的一个GET请求的接口的一个测试用例，但是平时我们的接口请求方法除了GET还有POST，PUT，DELETE等等，那么浏览器毕竟不是专业的接口测试软件，而且它也无法测试POST这类型的的接口，那么我们就需要找一个专业的接口测试软件：Postman。"},
              {"Postman 的安装":"以前的Postman 除了mac版本都需要在Chrome的插件安装，但现在也推出Win和liunx的PC版，所以我们现在只需要到官方网站：https://www.getpostman.com/ 去根据自己的操作系统下载对应的版本便可。"}
            ]
          }
        }
    }
</script>

<style scoped>

</style>
